{
	"homepage": "https://www.curseforge.com/minecraft/mc-mods/entity-armor-models",
	"1.15.1": {
		"1.15.1-1.0.0.0": "Ported from 1.15.2. Downgraded code to support. Support will be dropped in favor of 1.15.2."
	},
	"1.15.2": {
		"1.15.2-1.0.0.0": "Ported from 1.16.1. Removed 1.16 mobs. Added zombie pigman support. Fixed mappings and imports."
	},
	"1.16.1": {
		"1.16.1-0.0.8.0": "Added support for creepers. Yes, they need armor for some reason.",
		"1.16.1-0.0.9.0": "Added support for endermen. Their screams tend to go through head layers.",
		"1.16.1-0.0.10.0": "Added support for all biped renderers. You can now see arrows in these mobs and a bit of armor for the vex.",
		"1.16.1-0.0.11.0": "Added support for piglins. I forgot they existed as biped renderers.",
		"1.16.1-0.0.12.0": "Added support for slimes...and magma cubes. Can't forget the magma cubes... Fixes vex legs not rendering correct for armor. Fixes an issue with the creeper head layer when skulls are applied.",
		"1.16.1-0.0.13.0": "Definitely forgot about the magma cubes. Now there's magma cubes.",
		"1.16.1-0.0.14.0": "Code cleanup and hierarchy fixes. Switched from ATs to reflection storages for faster load times and better compatibility. Still need to implement ageable model difference AgeableModels. Also added that annoying update message. No worries, it can be disabled in the config :)",
		"1.16.1-0.0.15.0": "Implemented AgeableModel interface using Method storage via reflection. Restructured config to allow disabling of specific layers to change amount of resource allocation. Also added horses support.",
		"1.16.1-0.0.16.0": "The well known overworld's spider and witch have been added to the game. They should've been added earlier but shhh. Wait. How did cave spiders get in here? Also fixed update notification to allow for localization.",
		"1.16.1-0.0.17.0": "The nether has leaked in! Blazes and ghasts are now supported! Entity Settings has been renamed and organized under Special Settings. Entity Settings will be used for enabling or disabling layers on a specific entity added by this mod.",
		"1.16.1-0.0.18.0": "Fortress mobs time! Well mob. Added support for silverfish. Wait...endermites too. Major fixes with textures not completely being set to the correct size causing incorrect mappings.",
		"1.16.1-0.0.19.0": "Reorganized entire system to allow for mod development. Wrote javadocs for interfaces that should be used. Exclude sources that are irrelevant to utilizing this mod as a base. The file storage is currently named 'base' as 'api' does not seem to reflect the this mod very well.",
		"1.16.1-0.0.20.0": "Added the illagers. (They were so similar to witches). Renamed 'base' to 'api' because that's what it's supposed to be. Also, it would get confusing for other programmers. Also broke some more api, which is fine until 1.0 get released.",
		"1.16.1-0.0.21.0": "Added support for custom armor models. Mods using this must be ordered after this one. Also, guardians are a thing now.",
		"1.16.1-0.0.22.0": "Added javadocs to ItemRendererExtension and LayerRenderers. Added support for the hoglins and zoglins of the world.",
		"1.16.1-0.0.23.0": "Added javadocs to the models explaining some usage. Fixed an issue with child renderers. Fixed an issue with the other child renderers. Updated to v32.0.108.",
		"1.16.1-0.0.24.0": "Added support for phantoms. Reconfigured custom armor models to use functional interface over a singular model.",
		"1.16.1-0.0.25.0": "Added support for ravagers. Changed some access points for ModelRenderer arrays in favor of immutable lists. Added another LayerRenderer for armor that supports no customization for improved performance.",
		"1.16.1-0.0.26.0": "Added support for shulkers. This is the final beta before v1.0 release.",
		"1.16.1-1.0.0.0": "Code cleanup and optimization. Removed the elytra layer from the horse since it will never be displayed in any scenario. Added horse armor to zombie and skeleton horse. Support will be dropped in favor of 1.16.2."
	},
	"1.16.2": {
		"1.16.2-1.0.0.0": "Ported from 1.16.1. Added piglin brute support.",
		"1.16.2-1.0.1.0": "The Big Surprise Update. Added support for giant, iron golem, and polar bear."
	},
	"promos": {
		"1.15.1-latest": "1.15.1-1.0.0.0",
		"1.15.1-recommended": "1.15.1-1.0.0.0",
		"1.15.2-latest": "1.15.2-1.0.0.0",
		"1.15.2-recommended": "1.15.2-1.0.0.0",
		"1.16.1-latest": "1.16.1-1.0.0.0",
		"1.16.1-recommended": "1.16.1-1.0.0.0",
		"1.16.2-latest": "1.16.2-1.0.0.0",
		"1.16.2-recommended": "1.16.2-1.0.0.0"
	}
}